[
  {
    "category": "frontend",
    "description": "Rename 'Set Ally' to 'Diplomacy' and add surrender option",
    "status": "in_progress",
    "priority": "low",
    "passes": 1,
    "steps": [
      "FRONTEND - UI Changes:",
      "Rename setAllyBtn from 'Set Ally' to 'Diplomacy' in gameplay.go",
      "Rename drawAllyMenu() to drawDiplomacyMenu() and update panel title to 'Diplomacy'",
      "Add a 'Surrender' section to the diplomacy dialog with player selection buttons",
      "Add confirmation dialog: 'Surrender to [player]? All your territories and resources will be given to them.'",
      "After surrender, show message 'You have surrendered. You may continue watching the game.'",
      "BACKEND - Surrender Logic:",
      "Add new message type TypeSurrender in protocol/messages.go with SurrenderPayload (target player ID)",
      "Create handleSurrender() in handlers.go that: validates surrender is allowed, transfers all territories to target, transfers stockpile resources, marks player as Eliminated",
      "In game/player.go or game/state.go, add Surrender() method that transfers ownership of all territories and stockpile",
      "After surrender, call existing victory check - if only one non-eliminated player remains, end game",
      "Broadcast game state update to all players showing the surrender result",
      "FRONTEND - Post-Surrender State:",
      "Surrendered player should see the game but status bar shows 'You have surrendered' instead of turn info",
      "Hide action buttons (End Turn, attack options, etc.) for surrendered players",
      "Player can still use chat and watch the game unfold"
    ],
    "dependencies": [],
    "notes": [
      "Reuses existing Eliminated flag on Player struct - surrender just sets this to true after transfer",
      "checkElimination() in combat.go shows existing elimination pattern",
      "Turn order logic already skips eliminated players (see development.go, shipment.go)",
      "Victory conditions already check for single remaining player",
      "Consider: Should surrender be allowed at any time, or only during your turn?"
    ],
    "references": [
      "internal/client/gameplay.go - setAllyBtn at line 435, showAllyMenu",
      "internal/client/gameplay_dialogs.go - drawAllyMenu() at line 749",
      "internal/game/player.go - Player struct with Eliminated field at line 49",
      "internal/game/combat.go - checkElimination() at line 422",
      "internal/game/state.go - victory condition checks"
    ]
  }
]
